package com.zhsl.test;

import com.alibaba.fastjson.JSON;
import com.alibaba.fastjson.JSONArray;
import com.zhsl.data.entity.Area;
import com.zhsl.data.entity.AreaProgessVo;
import com.zhsl.data.entity.FamilyVo;
import com.zhsl.data.jdbc.pg.PgJdbc;
import org.jsoup.Jsoup;
import org.jsoup.nodes.Document;
import org.jsoup.nodes.Element;
import org.jsoup.select.Elements;
import org.junit.Test;

import java.io.File;
import java.io.FileWriter;
import java.io.Writer;
import java.net.URL;
import java.sql.ResultSet;
import java.util.ArrayList;
import java.util.List;

/**
 * @author xiangjg
 * @date 2019/3/18 11:18
 */
public class AreaTest {

    //统计局行政区划代码入库
    @Test
    public void test() {
        java.sql.Connection con = null;
        java.sql.Statement sta = null;
        try {
            String url = "http://www.stats.gov.cn/tjsj/tjbz/tjyqhdmhcxhfdm/2018/52.html";
            List<Area> list = getArea(url, "520000000000000", 2);

//            // 1：利用File类找到要操作的对象
//            File file = new File("D:" + File.separator + "area" + File.separator + "area.json");
//            if (!file.getParentFile().exists()) {
//                file.getParentFile().mkdirs();
//            }
//            //2：准备输出流
//            Writer out = new FileWriter(file);
//            out.write(JSON.toJSONString(list));
//            out.close();
            con = PgJdbc.getNewConnection("jdbc:postgresql://42.123.116.132:5432/SmartWaterDB", "watercloud-!@#123QWE");
            sta = con.createStatement();
            for (Area area : list
                    ) {
                String sql = "insert into public.area values('" + area.getAdcd() + "','" + area.getAdnm() + "','" + area.getPadcd() + "'," + area.getLevel() + ")";
                sta.execute(sql);
            }
        } catch (Exception e) {
            e.printStackTrace();
        } finally {
            try {
                if (sta != null)
                    sta.close();
                if (con != null)
                    con.close();
            } catch (Exception e) {
                e.printStackTrace();
            }

        }
    }

    private List<Area> getArea(String url, String padcd, int level) throws Exception {
        String name = "";
        if (level == 2)
            name = "citytr";
        if (level == 3)
            name = "countytr";
        if (level == 4)
            name = "towntr";
        if (level == 5)
            name = "villagetr";
        List<Area> list = new ArrayList<>();
        Document doc = null;
        try {
            doc = Jsoup.parse(new URL(url), 5000);
        } catch (Exception e) {
            doc = Jsoup.parse(new URL(url), 5000);
        }

        Elements trList = doc.getElementsByClass(name);
        for (Element e : trList
                ) {
            Area area = new Area();
            Elements aList = e.getElementsByTag("a");
            if (aList.size() > 0) {
                area.setAdcd(aList.get(0).html());
                area.setAdnm(aList.get(1).html());
                area.setPadcd(padcd);
                area.setLevel(level);
                list.add(area);
                String cUrl = url.substring(0, url.lastIndexOf("/") + 1);
                list.addAll(getArea(cUrl + aList.get(0).attr("href"), aList.get(0).html(), level + 1));
            } else {
                Elements tdList = e.getElementsByTag("td");
                if (tdList.size() > 0) {
                    area.setAdcd(tdList.get(0).html());
                    area.setAdnm(tdList.get(tdList.size() - 1).html());
                    area.setPadcd(padcd);
                    area.setLevel(level);
                    list.add(area);
                }
            }
        }

        return list;
    }

    @Test
    public void jsonToDB() {
        String jsonStr = "[[\"安顺市\",\"西秀区\",\"517\",\"2\",\"515\",\"2540\",\"8\",\"2532\",\"32\"],[\"安顺市\",\"平坝区\",\"10\",\"10\",\"0\",\"36\",\"36\",\"0\",\"100\"],[\"安顺市\",\"普定县\",\"2087\",\"168\",\"1919\",\"7573\",\"573\",\"7000\",\"100\"],[\"安顺市\",\"镇宁县\",\"3499\",\"1941\",\"1558\",\"15745\",\"8306\",\"7439\",\"100\"],[\"安顺市\",\"关岭县\",\"2982\",\"1185\",\"1797\",\"13161\",\"5274\",\"7887\",\"85\"],[\"安顺市\",\"紫云县\",\"4673\",\"716\",\"3957\",\"21015\",\"2923\",\"18092\",\"30\"],[],[\"毕节市\",\"七星关区\",\"31870\",\"2729\",\"29141\",\"139319\",\"10985\",\"128334\",\"91\"],[\"毕节市\",\"大方县\",\"35998\",\"3396\",\"32602\",\"128105\",\"10692\",\"117413\",\"78\"],[\"毕节市\",\"黔西县\",\"5299\",\"694\",\"4605\",\"20320\",\"1999\",\"18321\",\"35\"],[\"毕节市\",\"金沙县\",\"12618\",\"7846\",\"4772\",\"52992\",\"29098\",\"23894\",\"24\"],[\"毕节市\",\"织金县\",\"47530\",\"17405\",\"30125\",\"179651\",\"66069\",\"113582\",\"51\"],[\"毕节市\",\"纳雍县\",\"20574\",\"10567\",\"10007\",\"83160\",\"42717\",\"40443\",\"31\"],[\"毕节市\",\"威宁县\",\"44245\",\"23400\",\"20845\",\"204418\",\"105330\",\"99088\",\"70\"],[\"毕节市\",\"赫章县\",\"39473\",\"19691\",\"19782\",\"195484\",\"94748\",\"100736\",\"39\"],[\"毕节市\",\"百里杜鹃\",\"6317\",\"4218\",\"2099\",\"21256\",\"14256\",\"7000\",\"95\",105.93554,27.17888],[\"毕节市\",\"金海湖新区\",\"12084\",\"8307\",\"3777\",\"42655\",\"33818\",\"8837\",\"63\",105.431113243103,27.232156434805],[],[\"黔东南州\",\"凯里市\",\"2608\",\"564\",\"2044\",\"11890\",\"2293\",\"9597\",\"77\"],[\"黔东南州\",\"麻江县\",\"1510\",\"497\",\"1013\",\"6191\",\"2000\",\"4191\",\"100\"],[\"黔东南州\",\"丹寨县\",\"2372\",\"1241\",\"1131\",\"10000\",\"5000\",\"5000\",\"100\"],[\"黔东南州\",\"雷山县\",\"2988\",\"805\",\"2183\",\"12352\",\"3230\",\"9122\",\"100\"],[\"黔东南州\",\"台江县\",\"4844\",\"2001\",\"2843\",\"23000\",\"8000\",\"15000\",\"38\"],[\"黔东南州\",\"剑河县\",\"15929\",\"13048\",\"2881\",\"59266\",\"46150\",\"13116\",\"20\"],[\"黔东南州\",\"黄平县\",\"8668\",\"1826\",\"6842\",\"34966\",\"7245\",\"27721\",\"53\"],[\"黔东南州\",\"施秉县\",\"1871\",\"629\",\"1242\",\"8455\",\"2785\",\"5670\",\"100\"],[\"黔东南州\",\"镇远县\",\"398\",\"398\",\"0\",\"1615\",\"1615\",\"0\",\"100\"],[\"黔东南州\",\"岑巩县\",\"5956\",\"863\",\"5093\",\"25601\",\"3248\",\"22353\",\"97\"],[\"黔东南州\",\"三穗县\",\"4743\",\"903\",\"3840\",\"18039\",\"3265\",\"14774\",\"100\"],[\"黔东南州\",\"天柱县\",\"14867\",\"2971\",\"11896\",\"54527\",\"8191\",\"46336\",\"52\"],[\"黔东南州\",\"锦屏县\",\"3768\",\"1441\",\"2327\",\"16426\",\"6000\",\"10426\",\"54\"],[\"黔东南州\",\"黎平县\",\"14595\",\"1168\",\"13427\",\"62197\",\"4491\",\"57706\",\"64\"],[\"黔东南州\",\"从江县\",\"4217\",\"2442\",\"1775\",\"19222\",\"10577\",\"8645\",\"71\"],[\"黔东南州\",\"榕江县\",\"6908\",\"3034\",\"3874\",\"29468\",\"12986\",\"16482\",\"42\"],[\"黔东南州\",\"开发区\",\"1066\",\"375\",\"691\",\"4558\",\"1488\",\"3070\",\"43\"],[],[\"黔南州\",\"都匀市\",\"5800\",\"56\",\"5744\",\"24650\",\"210\",\"24440\",\"48\"],[\"黔南州\",\"独山县\",\"5467\",\"58\",\"5409\",\"25968\",\"217\",\"25751\",\"100\"],[\"黔南州\",\"平塘县\",\"5759\",\"425\",\"5334\",\"25961\",\"1595\",\"24366\",\"86\"],[\"黔南州\",\"荔波县\",\"2629\",\"112\",\"2517\",\"10908\",\"461\",\"10447\",\"100\"],[\"黔南州\",\"三都县\",\"11792\",\"1168\",\"10624\",\"61993\",\"5255\",\"56738\",\"55\"],[\"黔南州\",\"福泉市\",\"11007\",\"260\",\"10747\",\"42568\",\"937\",\"41631\",\"74\"],[\"黔南州\",\"瓮安县\",\"7287\",\"10\",\"7277\",\"28315\",\"29\",\"28286\",\"100\"],[\"黔南州\",\"贵定县\",\"6207\",\"418\",\"5789\",\"25515\",\"1245\",\"24270\",\"100\"],[\"黔南州\",\"龙里县\",\"1510\",\"0\",\"1510\",\"5926\",\"0\",\"5926\",\"100\"],[\"黔南州\",\"惠水县\",\"6192\",\"629\",\"5563\",\"32731\",\"2534\",\"30197\",\"100\"],[\"黔南州\",\"长顺县\",\"2530\",\"672\",\"1858\",\"11467\",\"2873\",\"8594\",\"46\"],[\"黔南州\",\"罗甸县\",\"7789\",\"1345\",\"6444\",\"33441\",\"5366\",\"28075\",\"91\"],[],[\"黔西南州\",\"兴义市\",\"9039\",\"64\",\"8975\",\"41171\",\"252\",\"40919\",\"83\"],[\"黔西南州\",\"兴仁县\",\"535\",\"0\",\"535\",\"2399\",\"0\",\"2399\",\"100\"],[\"黔西南州\",\"普安县\",\"2607\",\"225\",\"2382\",\"12449\",\"782\",\"11667\",\"83\"],[\"黔西南州\",\"晴隆县\",\"8811\",\"4475\",\"4336\",\"37917\",\"17685\",\"20232\",\"52\"],[\"黔西南州\",\"贞丰县\",\"6768\",\"52\",\"6716\",\"29297\",\"237\",\"29060\",\"100\"],[\"黔西南州\",\"安龙县\",\"6568\",\"17\",\"6551\",\"28271\",\"68\",\"28203\",\"100\"],[\"黔西南州\",\"册亨县\",\"3105\",\"0\",\"3105\",\"13555\",\"0\",\"13555\",\"76\"],[\"黔西南州\",\"望谟县\",\"6512\",\"929\",\"5583\",\"31565\",\"4196\",\"27369\",\"82\"],[\"黔西南州\",\"义龙新区\",\"2075\",\"10\",\"2065\",\"9165\",\"34\",\"9131\",\"100\"],[],[\"铜仁市\",\"碧江区\",\"1608\",\"0\",\"1608\",\"5979\",\"0\",\"5979\",\"100\"],[\"铜仁市\",\"万山区\",\"10\",\"10\",\"0\",\"58\",\"58\",\"0\",\"100\"],[\"铜仁市\",\"思南县\",\"24711\",\"11322\",\"13389\",\"97311\",\"45000\",\"52311\",\"91\"],[\"铜仁市\",\"石阡县\",\"10042\",\"2168\",\"7874\",\"40170\",\"8254\",\"31916\",\"100\"],[\"铜仁市\",\"德江县\",\"17919\",\"8653\",\"9266\",\"72297\",\"36000\",\"36297\",\"100\"],[\"铜仁市\",\"松桃县\",\"18626\",\"8981\",\"9645\",\"92996\",\"50864\",\"42132\",\"84\"],[\"铜仁市\",\"沿河县\",\"29518\",\"14775\",\"14743\",\"115682\",\"57905\",\"57777\",\"52\"],[\"铜仁市\",\"印江县\",\"9984\",\"586\",\"9398\",\"42321\",\"1919\",\"40402\",\"100\"],[],[\"遵义市\",\"播州区\",\"24\",\"24\",\"0\",\"82\",\"82\",\"0\",\"100\"],[\"遵义市\",\"余庆县\",\"13\",\"13\",\"0\",\"47\",\"47\",\"0\",\"100\"],[\"遵义市\",\"务川县\",\"214\",\"214\",\"0\",\"793\",\"793\",\"0\",\"100\"],[\"遵义市\",\"凤冈县\",\"961\",\"1\",\"960\",\"4564\",\"3\",\"4561\",\"100\"],[\"遵义市\",\"汇川区\",\"30\",\"30\",\"0\",\"113\",\"113\",\"0\",\"100\"],[\"遵义市\",\"习水县\",\"2581\",\"0\",\"2581\",\"11972\",\"0\",\"11972\",\"100\"],[\"遵义市\",\"桐梓县\",\"673\",\"0\",\"673\",\"2779\",\"0\",\"2779\",\"100\"],[\"遵义市\",\"正安县\",\"2239\",\"0\",\"2239\",\"9874\",\"0\",\"9874\",\"100\"],[\"遵义市\",\"红花岗区\",\"36\",\"36\",\"0\",\"120\",\"120\",\"0\",\"100\"],[\"遵义市\",\"道真县\",\"33\",\"33\",\"0\",\"124\",\"124\",\"0\",\"100\"],[\"遵义市\",\"湄潭县\",\"7\",\"7\",\"0\",\"29\",\"29\",\"0\",\"100\"],[\"遵义市\",\"绥阳县\",\"3110\",\"67\",\"3043\",\"14641\",\"220\",\"14421\",\"54\"],[\"仁怀市\",\"仁怀市\",\"121\",\"121\",\"0\",\"360\",\"360\",\"0\",\"100\"],[],[\"六盘水市\",\"六枝特区\",\"13511\",\"1096\",\"12415\",\"57714\",\"4323\",\"53391\",\"99\"],[\"六盘水市\",\"盘州市\",\"9585\",\"2733\",\"6852\",\"31715\",\"7779\",\"23936\",\"100\"],[\"六盘水市\",\"水城县\",\"24050\",\"3557\",\"20493\",\"95313\",\"13637\",\"81676\",\"69\"],[\"六盘水市\",\"钟山区\",\"8686\",\"11\",\"8675\",\"37931\",\"15\",\"37916\",\"82\"],[\"0\",\"0\",\"665365\",\"201844\",\"463521\",\"2795420\",\"827017\",\"1968403\",\"2338\"]]";
        java.sql.Connection con = null;
        java.sql.Statement sta = null;
        try {
            con = PgJdbc.getConnection();
            sta = con.createStatement();
            List<AreaProgessVo> list = new ArrayList<>();
            ResultSet rs = sta.executeQuery("select * from drinkingwaterdb.t_area_progress where level=3");
            while (rs.next()) {
                AreaProgessVo o = new AreaProgessVo();
                o.setAdcd(rs.getString("adcd"));
                o.setAdnm(rs.getString("adnm"));
                list.add(o);
            }


            JSONArray jsonArray = JSON.parseArray(jsonStr);
            for (AreaProgessVo areaProgessVo:list
                 ) {
                for(int i=0;i<jsonArray.size();i++){
                    JSONArray strings = jsonArray.getJSONArray(i);
                    if(strings.size()>0&&strings.getString(1).equals(areaProgessVo.getAdnm())){
                        areaProgessVo.setFamily(strings.getBigDecimal(2));
                        areaProgessVo.setPoorFamily(strings.getBigDecimal(3));
                        areaProgessVo.setNum(strings.getBigDecimal(5));
                        areaProgessVo.setPoorNum(strings.getBigDecimal(6));
                        areaProgessVo.setProcess(strings.getInteger(8));
                        break;
                    }
                }
            }
            System.out.println(list.toString());
            for (AreaProgessVo areaProgessVo:list
                    ) {
                if(areaProgessVo.getProcess()!=null){
                    String sql = String.format("update drinkingwaterdb.t_area_progress set family=%s,poor_family=%s,nums=%s,poor_nums=%s,progress=%s where adcd='%s'",
                            areaProgessVo.getFamily().toString(),areaProgessVo.getPoorFamily().toString(),areaProgessVo.getNum().toString(),areaProgessVo.getPoorNum().toString(),areaProgessVo.getProcess().toString(),areaProgessVo.getAdcd());
                    System.out.println(sql);
                    sta.execute(sql);
                }
            }
        } catch (Exception e) {
            e.printStackTrace();
        } finally {
            try {
                if (sta != null)
                    sta.close();
                if (con != null)
                    con.close();
            } catch (Exception e) {
                e.printStackTrace();
            }

        }
    }
}
